// Задача №3. Напишите программу, которая будет выдавать название дня недели по заданному номеру.
// 3 -> Среда 
// 5 -> Пятница



if numberA = 1 
{
    Console.WriteLine("Понедельник");
}
else
{}