// Задача №3. Напишите программу, которая будет выдавать название дня недели по заданному номеру.
// 3 -> Среда 
// 5 -> Пятница


Console.WriteLine("Введите число от 1 до 7");
string? answer = Console.ReadLine();
int number = Convert.ToInt32(answer);


//if (number || 7 )  

    Console.WriteLine("Понедельник");

else
{}