// Задача 13: Напишите программу, 
// которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// ​
// 645 -> 5
// ​
// 78 -> третьей цифры нет
// ​
// 32679 -> 6

// через цикл решать


Console.WriteLine("Введите число");
int n = Convert.ToInt32(Console.ReadLine());
int rez = 1;
// if (n <= 9999)
// {
//     rez = n / 10;
//     rez = rez % 10;
//     Console.WriteLine(rez);
// }
// else if (n <= 99999)
// {
//     int rez1 = n / 100;
//     rez1 = rez1 % 10;
//     Console.WriteLine(rez1);
// }
// if (n <= 99 && n > 100)
// {
//     Console.WriteLine("rez");
// }
// while (n >= 9999)
// {
//     int rez1 = n / 100;
//     rez = rez1 % 10;
//     Console.WriteLine(rez);
//     break;
//     //if (n < 999)

    
// }
//Console.WriteLine("no");


